START_MESSAGE = ('Привет, {}! Я бот Tatur, моя цель - познакомить Вас с моим '
                 'автором.')

SOURCE_CODE = 'Исходный код бота'

SOURCE_CODE_ANSWER = 'Исходный код находится в репозитории по ссылке {}'

ACTIONS = 'Что ты умеешь?'

HELP_MESSAGE = ('Мой функционал достаточно ограничен, однако я умею:\n\n'
                '— Отправлять приветственное сообщение по команде /start\n'
                '— Делиться ссылкой на исходный код по текстовой команде '
                f'*{SOURCE_CODE}*\n'
                '— Рассказывать о своих возможностях по текстовой команде '
                f'*{ACTIONS}*\n'
                '— Будет дополняться')
