START_MESSAGE = ('Привет, {}! Я бот Tatur, моя цель - познакомить Вас с моим '
                 'автором.')

SOURCE_CODE = 'Исходный код бота'

TO_ACTIONS = 'Ясно! Как тобой пользоваться?'

ACTIONS = ('Мой функционал достаточно ограничен, однако я умею:\n\n'
           '— Отправлять ссылку на исходный код по команде /repo\n'
           '— Передавать сообщение по команде /nextstep <сообщение>\n'
           '— Выполнять действие при нажатии кнопок или вводе текста\n'
           '— Выполнять действия по голосовым командам, переданным в '
           'голосовом сообщении (для разницы SQL и NoSQL произнесите '
           '"Базы данных", для информации о GPT "Искусственный интеллект", '
           'остальные команды совпадают с текстом на кнопках)')

QR_CAPTION = 'Отсканируйте QR-код или перейдите по <a href="{}">ссылке.</a>'

SQL_NOSQL = 'Разница между SQL и NoSQL?'

SQL_ALIAS = 'базы данных'

GPT = 'Что такое GPT?'

GPT_ALIAS = 'искусственный интеллект'

HOBBY = 'Главное увлечение автора'

HOBBY_ANSWER = ('Главное увлечение автора - компьютеры.'
                '\n\nДмитрий долгое время изучал комплектующие, такие как '
                'видеокарта, процессор, оперативная память, блок питания, '
                'SSD и HDD, их производителей, нюансы компонентных баз. '
                'Интересен весь процесс сборки компьютера: подбор '
                'подходящих под требуемые задачи компонентов, проверка их '
                'совместимости, актуальности и прочее. Он даже был близок к '
                'тому, чтобы заняться сборкой и продажей компьютеров в '
                'качестве работы, однако программирование оказалось '
                'интереснее и перспективнее.'
                '\n\nУвлечение превратилось в периодическую помощью друзьям и '
                'знакомым в сборке и обслуживании ПК :)')

LOVE_STORY = 'История первой любви'

SELFIE = 'Селфи автора'

SCHOOL_PHOTO = 'Школьное фото автора'

LOG_USER = '@{} [{}]'
